#include <arpa/inet.h>
#include <liburing.h>
#include <netinet/in.h>
#include <poll.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/socket.h>
#include <unistd.h>

#define TURBO_DEBUG

#define QUEUE_DEPTH 8
#define BUF_SIZE 1024

int make_nonblocking(int fd) {
  int flags = fcntl(fd, F_GETFL, 0);
  return fcntl(fd, F_SETFL, flags | O_NONBLOCK);
}

#define п8 uint8_t
#define п16 uint16_t
#define п32 uint32_t
#define п64 uint64_t
#define ц8 int8_t
#define ц16 int16_t
#define ц32 int32_t
#define ц64 int64_t
#define д32 float
#define д64 double
#define логічне uint8_t
#define позитивне п64
#define ціле ц64
#define дійсне д64
#define ніщо void
#define невідома_адреса void*
#define невідома_памʼять void*
#define памʼять_п8 п8*
#define адреса_памʼять_п8 п8**
#define памʼять_памʼять_п8 п8**
#define адреса_позитивне позитивне*
typedef struct т8 {
  позитивне розмір;
  памʼять_п8 дані;
} т8;
typedef struct ю8 {
  позитивне розмір;
  памʼять_п8 дані;
} ю8;
#define памʼять_т8 т8*
#define памʼять_ю8 ю8*

typedef struct Виділяч Виділяч;

struct Виділяч {
  невідома_адреса користувацькі_дані;

  памʼять_п8 (*виділити_сиру_памʼять)(Виділяч* виділяч, позитивне розмір);

  памʼять_п8 (*перевиділити_сиру_памʼять)(Виділяч* виділяч,
                                          памʼять_п8 значення,
                                          позитивне новий_розмір);

  void (*звільнити_сиру_памʼять)(Виділяч* виділяч, памʼять_п8 значення);
};

// <турбо.в>

typedef struct Турбіна Турбіна;
typedef struct Подія Подія;
typedef struct ІнтернетЗвʼязок ІнтернетЗвʼязок;
typedef struct ЕлементЧергиЗаписуІнтернетЗвʼязку
    ЕлементЧергиЗаписуІнтернетЗвʼязку;
typedef struct ПрочитанеІнтернетЗвʼязку ПрочитанеІнтернетЗвʼязку;

typedef enum {
  ТипПодіїІнтернетЗвʼязокПідключено,
  ТипПодіїІнтернетЗвʼязокПрочитано,
  ТипПодіїІнтернетЗвʼязокЗаписано
} ТипПодії;

typedef void (*ТурбоВідкликТурбіни)(Турбіна* турбіна, невідома_адреса аргумент);

typedef void (*ТурбоОбробникПідключенняІнтернетЗвʼязку)(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок,
    невідома_адреса аргумент);

typedef void (*ТурбоОбробникВідключенняІнтернетЗвʼязку)(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок,
    невідома_адреса аргумент,
    позитивне помилка);

typedef void (*ТурбоОбробникДанихІнтернетЗвʼязку)(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок,
    невідома_адреса аргумент,
    позитивне розмір,
    памʼять_п8 дані);

typedef void (*ТурбоОбробникЗакриттяІнтернетЗвʼязку)(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок,
    невідома_адреса аргумент);

typedef void (*ТурбоОбробникЗаписуІнтернетЗвʼязку)(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок,
    невідома_адреса аргумент_інтернет_звʼязку,
    невідома_адреса аргумент_запису,
    позитивне розмір,
    памʼять_п8 дані);

struct ІнтернетЗвʼязок {
  int fd;
  ТурбоОбробникПідключенняІнтернетЗвʼязку обробник_підключення;
  ТурбоОбробникВідключенняІнтернетЗвʼязку обробник_відключення;
  ТурбоОбробникДанихІнтернетЗвʼязку обробник_даних;
  ТурбоОбробникЗакриттяІнтернетЗвʼязку обробник_закриття;
  невідома_адреса аргумент;
  ЕлементЧергиЗаписуІнтернетЗвʼязку* перший_елемент_черги_запису;
  ЕлементЧергиЗаписуІнтернетЗвʼязку* останній_елемент_черги_запису;
  логічне очікує_на_прочитано;
  логічне очікує_на_записано;
  логічне закрито;
};

struct ЕлементЧергиЗаписуІнтернетЗвʼязку {
  ЕлементЧергиЗаписуІнтернетЗвʼязку* наступний;
  ІнтернетЗвʼязок* інтернет_звʼязок;
  позитивне розмір;
  памʼять_п8 дані;
  позитивне розмір_записаного;
  ТурбоОбробникЗаписуІнтернетЗвʼязку обробник_запису;
  невідома_адреса аргумент;
};

struct ПрочитанеІнтернетЗвʼязку {
  ІнтернетЗвʼязок* інтернет_звʼязок;
  позитивне розмір;
  памʼять_п8 дані;
};

struct Подія {
  ТипПодії тип;
  union {
    ІнтернетЗвʼязок* інтернет_звʼязок;
    ЕлементЧергиЗаписуІнтернетЗвʼязку* елемент_черги_запису_інтернет_звʼязку;
    ПрочитанеІнтернетЗвʼязку* прочитане_інтернет_звʼязку;
  } обʼєкт;
};

struct Турбіна {
  Виділяч* виділяч;
  struct io_uring ring;
  int qcount;
};

extern Турбіна* __турбо__створити_турбіну(Виділяч* виділяч) {
  Турбіна* турбіна =
      (Турбіна*)виділяч->виділити_сиру_памʼять(виділяч, sizeof(Турбіна));

  турбіна->виділяч = виділяч;

  io_uring_queue_init(QUEUE_DEPTH, &турбіна->ring, 0);

  турбіна->qcount = 0;

  return турбіна;
}

void слухати_інтернет_звʼязок_підключено(Турбіна* турбіна,
                                         ІнтернетЗвʼязок* інтернет_звʼязок) {
  struct io_uring_sqe* sqe = io_uring_get_sqe(&турбіна->ring);

  Подія* дані_події = (Подія*)турбіна->виділяч->виділити_сиру_памʼять(
      турбіна->виділяч, sizeof(Подія));
  дані_події->тип = ТипПодіїІнтернетЗвʼязокПідключено;
  дані_події->обʼєкт.інтернет_звʼязок = інтернет_звʼязок;

  io_uring_prep_poll_add(sqe, дані_події->обʼєкт.інтернет_звʼязок->fd, POLLOUT);
  io_uring_sqe_set_data(sqe, дані_події);
  io_uring_submit(&турбіна->ring);

  турбіна->qcount++;
}

void слухати_інтернет_звʼязок_прочитано(Турбіна* турбіна,
                                        ІнтернетЗвʼязок* інтернет_звʼязок) {
  if (інтернет_звʼязок->очікує_на_прочитано) {
    return;
  }

  struct io_uring_sqe* sqe = io_uring_get_sqe(&турбіна->ring);

  ПрочитанеІнтернетЗвʼязку* прочитане =
      (ПрочитанеІнтернетЗвʼязку*)турбіна->виділяч->виділити_сиру_памʼять(
          турбіна->виділяч, sizeof(ПрочитанеІнтернетЗвʼязку));
  прочитане->інтернет_звʼязок = інтернет_звʼязок;
  прочитане->розмір = 4096;
  прочитане->дані =
      турбіна->виділяч->виділити_сиру_памʼять(турбіна->виділяч, 4096);

#ifdef TURBO_DEBUG
  memset(прочитане->дані, 0, 4096);
#endif

  Подія* подія = (Подія*)турбіна->виділяч->виділити_сиру_памʼять(
      турбіна->виділяч, sizeof(Подія));
  подія->тип = ТипПодіїІнтернетЗвʼязокПрочитано;
  подія->обʼєкт.прочитане_інтернет_звʼязку = прочитане;

  io_uring_prep_read(sqe, інтернет_звʼязок->fd, прочитане->дані,
                     прочитане->розмір, 0);
  io_uring_sqe_set_data(sqe, подія);
  io_uring_submit(&турбіна->ring);

  інтернет_звʼязок->очікує_на_прочитано = true;
  турбіна->qcount++;
}

void слухати_інтернет_звʼязок_записано(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок,
    ЕлементЧергиЗаписуІнтернетЗвʼязку* елемент_черги_запису_інтернет_звʼязку) {
  if (інтернет_звʼязок->очікує_на_записано) {
    return;
  }

  struct io_uring_sqe* sqe = io_uring_get_sqe(&турбіна->ring);

  Подія* подія = (Подія*)турбіна->виділяч->виділити_сиру_памʼять(
      турбіна->виділяч, sizeof(Подія));
  подія->тип = ТипПодіїІнтернетЗвʼязокЗаписано;
  подія->обʼєкт.елемент_черги_запису_інтернет_звʼязку =
      елемент_черги_запису_інтернет_звʼязку;

  io_uring_prep_write(
      sqe, інтернет_звʼязок->fd,
      елемент_черги_запису_інтернет_звʼязку->дані +
          елемент_черги_запису_інтернет_звʼязку->розмір_записаного,
      елемент_черги_запису_інтернет_звʼязку->розмір -
          елемент_черги_запису_інтернет_звʼязку->розмір_записаного,
      0);
  io_uring_sqe_set_data(sqe, подія);
  io_uring_submit(&турбіна->ring);

  інтернет_звʼязок->очікує_на_записано = true;
  турбіна->qcount++;
}

extern логічне __турбо__підключити_інтернет_звʼязок(
    Турбіна* турбіна,
    ю8 іа,
    позитивне порт,
    ТурбоОбробникПідключенняІнтернетЗвʼязку обробник_підключення,
    ТурбоОбробникДанихІнтернетЗвʼязку обробник_даних,
    ТурбоОбробникЗакриттяІнтернетЗвʼязку обробник_закриття,
    ТурбоОбробникВідключенняІнтернетЗвʼязку обробник_відключення,
    невідома_адреса аргумент) {
  int sockfd = socket(AF_INET, SOCK_STREAM, 0);
  if (sockfd < 0) {
    return false;
  }

  if (make_nonblocking(sockfd) == -1) {
    return false;
  }

  struct sockaddr_in addr = {.sin_family = AF_INET, .sin_port = htons(8080)};
  inet_pton(AF_INET, "127.0.0.1", &addr.sin_addr);

  int res = connect(sockfd, (struct sockaddr*)&addr, sizeof(addr));
  if (res == -1 && errno != EINPROGRESS) {
    close(sockfd);
    return false;
  }

  ІнтернетЗвʼязок* інтернет_звʼязок =
      (ІнтернетЗвʼязок*)турбіна->виділяч->виділити_сиру_памʼять(
          турбіна->виділяч, sizeof(ІнтернетЗвʼязок));
  інтернет_звʼязок->fd = sockfd;
  інтернет_звʼязок->обробник_підключення = обробник_підключення;
  інтернет_звʼязок->обробник_даних = обробник_даних;
  інтернет_звʼязок->обробник_закриття = обробник_закриття;
  інтернет_звʼязок->обробник_відключення = обробник_відключення;
  інтернет_звʼязок->аргумент = аргумент;
  інтернет_звʼязок->перший_елемент_черги_запису = NULL;
  інтернет_звʼязок->останній_елемент_черги_запису = NULL;
  інтернет_звʼязок->очікує_на_прочитано = false;
  інтернет_звʼязок->очікує_на_записано = false;
  інтернет_звʼязок->закрито = false;

  слухати_інтернет_звʼязок_підключено(турбіна, інтернет_звʼязок);

  return true;
}

void обробити_інтернет_звʼязок_закрито(Турбіна* турбіна,
                                       ІнтернетЗвʼязок* інтернет_звʼязок) {
  if (!інтернет_звʼязок->очікує_на_прочитано &&
      !інтернет_звʼязок->очікує_на_записано) {
    close(інтернет_звʼязок->fd);

    ЕлементЧергиЗаписуІнтернетЗвʼязку* елемет_черги_запису =
        інтернет_звʼязок->перший_елемент_черги_запису;

    while (елемет_черги_запису != NULL) {
      if (елемет_черги_запису->обробник_запису != NULL) {
        елемет_черги_запису->обробник_запису(
            турбіна, інтернет_звʼязок, інтернет_звʼязок->аргумент,
            елемет_черги_запису->аргумент, елемет_черги_запису->розмір,
            елемет_черги_запису->дані);
      }

      ЕлементЧергиЗаписуІнтернетЗвʼязку* наступний =
          елемет_черги_запису->наступний;

      free(елемет_черги_запису);

      елемет_черги_запису = наступний;
    }

    інтернет_звʼязок->обробник_відключення(турбіна, інтернет_звʼязок,
                                           інтернет_звʼязок->аргумент, 0);

    free(інтернет_звʼязок);
  }
}

static void обробити_інтернет_звʼязок_підключено(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок) {
  int err = 0;
  socklen_t len = sizeof(err);
  int result =
      getsockopt(інтернет_звʼязок->fd, SOL_SOCKET, SO_ERROR, &err, &len);

  if (result == -1 || err != 0) {
    close(інтернет_звʼязок->fd);

    інтернет_звʼязок->обробник_відключення(турбіна, інтернет_звʼязок,
                                           інтернет_звʼязок->аргумент, 1);

    free(інтернет_звʼязок);
  } else {
    інтернет_звʼязок->обробник_підключення(турбіна, інтернет_звʼязок,
                                           інтернет_звʼязок->аргумент);

    слухати_інтернет_звʼязок_прочитано(турбіна, інтернет_звʼязок);
  }
}

static void обробити_інтернет_звʼязок_прочитано(
    Турбіна* турбіна,
    ПрочитанеІнтернетЗвʼязку* прочитане_інтернет_звʼязку,
    int res) {
  ІнтернетЗвʼязок* інтернет_звʼязок =
      прочитане_інтернет_звʼязку->інтернет_звʼязок;

  інтернет_звʼязок->очікує_на_прочитано = false;

  if (інтернет_звʼязок->закрито) {
    free(прочитане_інтернет_звʼязку->дані);
    free(прочитане_інтернет_звʼязку);

    обробити_інтернет_звʼязок_закрито(турбіна, інтернет_звʼязок);
  } else if (res < 0) {
    free(прочитане_інтернет_звʼязку->дані);
    free(прочитане_інтернет_звʼязку);

    if (res == -EAGAIN) {
      слухати_інтернет_звʼязок_прочитано(турбіна, інтернет_звʼязок);
    } else {
      інтернет_звʼязок->закрито = true;

      обробити_інтернет_звʼязок_закрито(турбіна, інтернет_звʼязок);
    }
  } else if (res == 0) {
    free(прочитане_інтернет_звʼязку->дані);
    free(прочитане_інтернет_звʼязку);

    інтернет_звʼязок->закрито = true;

    інтернет_звʼязок->обробник_закриття(турбіна, інтернет_звʼязок,
                                        інтернет_звʼязок->аргумент);

    обробити_інтернет_звʼязок_закрито(турбіна, інтернет_звʼязок);
  } else {
    інтернет_звʼязок->обробник_даних(турбіна, інтернет_звʼязок,
                                     інтернет_звʼязок->аргумент, res,
                                     прочитане_інтернет_звʼязку->дані);

    слухати_інтернет_звʼязок_прочитано(турбіна, інтернет_звʼязок);

    free(прочитане_інтернет_звʼязку);
  }
}

static void обробити_інтернет_звʼязок_записано(
    Турбіна* турбіна,
    ЕлементЧергиЗаписуІнтернетЗвʼязку* елемент_черги_запису_інтернет_звʼязку,
    int res) {
  ІнтернетЗвʼязок* інтернет_звʼязок =
      елемент_черги_запису_інтернет_звʼязку->інтернет_звʼязок;

  інтернет_звʼязок->очікує_на_записано = false;
  if (інтернет_звʼязок->закрито) {
    обробити_інтернет_звʼязок_закрито(турбіна, інтернет_звʼязок);
  } else if (res < 0) {
    інтернет_звʼязок->закрито = true;

    обробити_інтернет_звʼязок_закрито(турбіна, інтернет_звʼязок);
  } else {
    інтернет_звʼязок->перший_елемент_черги_запису =
        елемент_черги_запису_інтернет_звʼязку->наступний;

    if (інтернет_звʼязок->останній_елемент_черги_запису ==
        елемент_черги_запису_інтернет_звʼязку) {
      інтернет_звʼязок->останній_елемент_черги_запису = NULL;
    }

    if (інтернет_звʼязок->перший_елемент_черги_запису != NULL) {
      слухати_інтернет_звʼязок_записано(
          турбіна, інтернет_звʼязок,
          інтернет_звʼязок->перший_елемент_черги_запису);
    }

    if (елемент_черги_запису_інтернет_звʼязку->обробник_запису != NULL) {
      елемент_черги_запису_інтернет_звʼязку->обробник_запису(
          турбіна, інтернет_звʼязок, інтернет_звʼязок->аргумент,
          елемент_черги_запису_інтернет_звʼязку->аргумент,
          елемент_черги_запису_інтернет_звʼязку->розмір,
          елемент_черги_запису_інтернет_звʼязку->дані);
    }

    free(елемент_черги_запису_інтернет_звʼязку);
  }
}

extern void __турбо__запустити_турбіну(Турбіна* турбіна,
                                       ТурбоВідкликТурбіни відклик_перед,
                                       ТурбоВідкликТурбіни відклик_після,
                                       невідома_адреса аргумент) {
  while (1) {
    if (турбіна->qcount == 0) {
      if (io_uring_cq_ready(&турбіна->ring) == 0) {
        return;
      }
    }

    if (відклик_перед != NULL) {
      відклик_перед(турбіна, аргумент);
    }

    struct io_uring_cqe* cqe;
    io_uring_wait_cqe(&турбіна->ring, &cqe);
    io_uring_cqe_seen(&турбіна->ring, cqe);
    турбіна->qcount--;

    Подія* дані_події = io_uring_cqe_get_data(cqe);

    if (cqe->res < 0) {
      fprintf(stderr, "Error: %s\n", strerror(-cqe->res));
      return;
    }

    if (дані_події->тип == ТипПодіїІнтернетЗвʼязокПідключено) {
      обробити_інтернет_звʼязок_підключено(турбіна,
                                           дані_події->обʼєкт.інтернет_звʼязок);
    } else if (дані_події->тип == ТипПодіїІнтернетЗвʼязокЗаписано) {
      обробити_інтернет_звʼязок_записано(
          турбіна, дані_події->обʼєкт.елемент_черги_запису_інтернет_звʼязку,
          cqe->res);
    } else if (дані_події->тип == ТипПодіїІнтернетЗвʼязокПрочитано) {
      обробити_інтернет_звʼязок_прочитано(
          турбіна, дані_події->обʼєкт.прочитане_інтернет_звʼязку, cqe->res);
    }

    free(дані_події);

    if (відклик_після != NULL) {
      відклик_після(турбіна, аргумент);
    }
  }
}

extern void __турбо__знищити_турбіну(Турбіна* турбіна) {
  io_uring_queue_exit(&турбіна->ring);

  турбіна->виділяч->звільнити_сиру_памʼять(турбіна->виділяч,
                                           (памʼять_п8)турбіна);
}

extern void __турбо__закрити_інтернет_звʼязок(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок) {
  інтернет_звʼязок->закрито = true;

  інтернет_звʼязок->обробник_закриття(турбіна, інтернет_звʼязок,
                                      інтернет_звʼязок->аргумент);

  обробити_інтернет_звʼязок_закрито(турбіна, інтернет_звʼязок);
}

extern void __турбо__записати_в_інтернет_звʼязок(
    Турбіна* турбіна,
    ІнтернетЗвʼязок* інтернет_звʼязок,
    позитивне розмір,
    памʼять_п8 дані,
    ТурбоОбробникЗаписуІнтернетЗвʼязку обробник_запису,
    невідома_адреса аргумент) {
  ЕлементЧергиЗаписуІнтернетЗвʼязку* елемент =
      (ЕлементЧергиЗаписуІнтернетЗвʼязку*)
          турбіна->виділяч->виділити_сиру_памʼять(
              турбіна->виділяч, sizeof(ЕлементЧергиЗаписуІнтернетЗвʼязку));
  елемент->наступний = NULL;
  елемент->інтернет_звʼязок = інтернет_звʼязок;
  елемент->розмір = розмір;
  елемент->дані = дані;
  елемент->розмір_записаного = 0;
  елемент->обробник_запису = обробник_запису;
  елемент->аргумент = аргумент;

  if (інтернет_звʼязок->перший_елемент_черги_запису == NULL) {
    інтернет_звʼязок->перший_елемент_черги_запису = елемент;
  }
  if (інтернет_звʼязок->останній_елемент_черги_запису == NULL) {
    інтернет_звʼязок->останній_елемент_черги_запису = елемент;
    слухати_інтернет_звʼязок_записано(турбіна, інтернет_звʼязок, елемент);
  } else {
    інтернет_звʼязок->останній_елемент_черги_запису->наступний = елемент;
    інтернет_звʼязок->останній_елемент_черги_запису = елемент;
  }
}

// </турбо.в>